Catalogs/КомбинацииКультур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КомбинацииКультур</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Культуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Культура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ур_ВидыКультур</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КомбинацииКультур/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Культуры.Сортировать("Культура возр");
	
	СтрокаНаим = "";
	
	Для Каждого СтрокаТЧ из Культуры Цикл
		
		СтрокаНаим = СтрокаНаим + "; "+ СтрокаТЧ.Культура.Наименование;
		
	КонецЦикла;
	 НаименованиеПолное = Сред(СтрокаНаим,3);

	Наименование = НаименованиеПолное;
    
КонецПроцедуры
